{
  "name": "Setup item Transport",
  "category": "antsportation:other",
  "icon": "antsportation:marker",
  "pages": [
    {
      "type": "patchouli:text",
      "text": "<gold>$(l:antsportation:blocks/ant_hill)Ant Hills$()</> are used as the beginning and the end of ant lines.<br>First place down an <gold>$(l:antsportation:blocks/ant_nest)Ant Nest</> and then put an Ant Hill on top of that.<br>You can input or output items into the Nest (not the ant hill) from any sides except the top!<br>Note: ants can carry any item in the <gold>antsportation:ant_transportable</> tag.",
      "title": "Input and output"
    },
    {
      "type": "patchouli:image",
      "title": "Input/Output",
      "border": true,
      "images": [
        "antsportation:patchouli/images/input.png",
        "antsportation:patchouli/images/output.png"
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Setting up a path",
      "text": "To set out a path for your ants to follow you have to use $(l:antsportation:items/marker)Markers$().<br>Place a marker down once every 8-10 blocks (lower will work too but it's a bit less reliable; Though if it works for 1 ant, it'll work for the others too!)."
    },
    {
      "type": "patchouli:text",
      "title": "Setting up a path",
      "text": "You can also place the markers on the sides of blocks to have them climb up walls like spiders can! Although don't make the path too small, because they might fall off.<br>When you connect the I/O Ant Hill to the final or first marker, make sure that the distance between the hill and the marker is more than 3 blocks, else ants might get stuck."
    },
    {
      "type": "patchouli:image",
      "title": "Path",
      "border": true,
      "images": [
        "antsportation:patchouli/images/path.png",
        "antsportation:patchouli/images/pathstart.png"
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Splitting",
      "text": "It's possible to split a stream of ants into 2. This can be done by placing 2 markers adjacent to the marker you want to split on.<br> You can afterwards colour the two markers and the ants will split on those paths (don't continue the white path).<br>You have to continue those paths in their respective colours. "
    },
    {
      "type": "patchouli:text",
      "text": "You can dye the markers with vanilla dyes.<br>If you want to split where a colored marker is, you first have to merge it with a white marker.<br>Make sure that the 2 colors that are next to the white marker are opposite of each other. Diagonal won't work!",
      "title": "Splitting"
    },
    {
      "type": "patchouli:image",
      "title": "Splitting",
      "border": true,
      "images": [
        "antsportation:patchouli/images/split.png"
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Merging",
      "text": "You can also merge colored paths back with white markers. This just happens when there is no colored marker within a 10 block radius, it'll try to find a white one and if there is one the ants will go to that one.<br>You can merge multiple colored ones with a white one. After this, just continue the white path!"
    },
    {
      "type": "patchouli:image",
      "title": "Merging",
      "border": true,
      "images": [
        "antsportation:patchouli/images/merge.png"
      ]
    },
    {
      "type": "patchouli:text",
      "title": "Start transporting!",
      "text": "To actually start the AntSportation you'll have to do one thing.<br>Right-click the Ant Hill the ants should come from (so the input) while holding an Ant jar with a queen ant inside.<br>After doing this the ants will pop out and start transporting your items!"
    }
  ]
}